Revit 2027 API
IFCPropertyMappingInfo(Boolean, String, ElementId, String) Constructor
 Constructs a new IFCPropertyMappingInfo with input values. The flag that indicates whether the property is included in export. The property name. The Revit property id. The Revit property name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCPropertyMappingInfo(
	bool exportFlag,
	string ifcPropertyName,
	ElementId revitPropertyId,
	string revitPropertyName
)
Public Sub New (
	exportFlag As Boolean,
	ifcPropertyName As String,
	revitPropertyId As ElementId,
	revitPropertyName As String
)
public:
IFCPropertyMappingInfo(
	bool exportFlag,
	String^ ifcPropertyName,
	ElementId^ revitPropertyId,
	String^ revitPropertyName
)
new :
        exportFlag : bool *
        ifcPropertyName : string *
        revitPropertyId : ElementId *
        revitPropertyName : string -> IFCPropertyMappingInfo
Parameters
exportFlag Boolean
ifcPropertyName String
revitPropertyId ElementId
revitPropertyName String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCPropertyMappingInfo Class
IFCPropertyMappingInfo Overload
Autodesk.Revit.DB Namespace